[
    {
        "title": "Budient",
        "route": "budient",
        "type": "Application web",
        "year": 2023,
        "image": "budient",
        "color": "#2EC4B6",
        "technologies": [
            "nodejs",
            "react",
            "typescript",
            "express",
            "mongodb",
            "jwt",
            "jest",
            "figma"
        ],
        "desc": "Ce projet consiste à créer une application de gestion de budget. L'objectif de l'application est de permettre à l'utilisateur de suivre ses revenus et ses dépenses et de mieux comprendre où va son argent.",
        "github": "https://github.com/aBgAmeuR/Budient",
        "objectif": "Créer une application web complète utilisant les technologies modernes : MongoDB, Express, React et Node.js (MERN stack).",
        "deroulement": "J’ai commencé par configurer la base de données MongoDB et créer les modèles de données à l'aide de Mongoose. Ensuite, J’ai créé une API RESTful pour les opérations CRUD des transactions, catégories, utilisateurs et l'authentification, tout en utilisant des middlewares pour la validation de la requête, l'authentification et la gestion des erreurs. Enfin, j’ai développé la partie client en créant les composants React pour afficher et gérer les données, ainsi que le système de navigation avec React Router."
    },
    {
        "title": "Smash or Pass",
        "route": "smash-or-pass",
        "type": "API REST",
        "year": 2023,
        "image": "smash-or-pass",
        "color": "#FA7531",
        "technologies": [
            "nodejs",
            "javascript",
            "express",
            "mysql",
            "jwt"
        ],
        "desc": "L’API fusionne les concepts de Tier list et de Smash or Pass. Le but de cette API est de permettre à des utilisateurs de créer et gérer des listes (Smash list) et de les partager.",
        "github": "https://github.com/aBgAmeuR/Smash-or-Pass",
        "objectif": "Concevoir une API RESTful en utilisant les technologies telles que Node.js, Express.js, Swagger, et MySQL. Implémenter des fonctionnalités d'authentification et d'autorisation pour restreindre l'accès aux ressources de l'API.",
        "deroulement": "J’ai commencé par définir les spécifications de l'API, en déterminant les endpoints nécessaires pour atteindre les objectifs du projet. Ensuite, j'ai choisi les technologies à utiliser, en prenant en compte mes compétences et les exigences du projet, telles que la rapidité de développement, la sécurité et la performance. Enfin, j'ai développé l'API en suivant les spécifications définies et en testant chaque endpoint pour m'assurer de son bon fonctionnement."
    },
    {
        "title": "Tic-tac-toe",
        "route":"tic-tac-toe",
        "type": "Jeu",
        "year": 2022,
        "image": "tic-tac-toe",
        "color": "#006600",
        "technologies": [
            "html",
            "css",
            "javascript"
        ],
        "desc": "Ce projet a pour objectif d'améliorer mes compétences en JavaScript en créant un jeu Tic-Tac-Toe avec une interface utilisateur en HTML/CSS et la logique de jeu en JavaScript.",
        "github": "https://github.com/aBgAmeuR/Tic-Tac-Toe",
        "objectif": "Le projet vise à développer les compétences en programmation JavaScript, en utilisant les concepts de base de la logique de programmation tels que les boucles, les conditions, les tableaux et les fonctions.",
        "deroulement": "J'ai commencé par concevoir l'interface utilisateur du jeu Tic-Tac-Toe en utilisant HTML et CSS. Enfin, j'ai implémenté la logique du jeu en JavaScript en créant des fonctions pour gérer les mouvements du joueur, pour vérifier les conditions de victoire et pour contrôler le déroulement du jeu."
    }
]